qemu-user-targets/CVE-2015-2051/squashfs-root/htdocs/web/hnap/SetWiFiVerifyAlpha.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<SetWiFiVerifyAlpha xmlns="http://purenetworks.com/HNAP1/" >
	<WPS>
		<DEV_PIN></DEV_PIN>
		<ResetToUnconfigured></ResetToUnconfigured>
		<WPSPBC></WPSPBC>
		<WPSPIN></WPSPIN>
	</WPS>
</SetWiFiVerifyAlpha>
</soap:Body>
</soap:Envelope>